{
  "projects": [
     {
      "title": "Technical Supervisor",
      "role": "",
      "company": "BHP",
      "from": "07/2025",
      "to": "Current",
      "location": "Western Australia",
      "description": "",
      "achievements": [
        "Took up a people leadership role with a team of 8",
        "Worked on optimisation and Automation problems within the inbound supply chain, with a focus on issues affecting maintenance",
        "70% time split between project work, 30% people leadership / minor improvement projects"
      ],
      "technologies": [
        "Python",
        "AWS",
        "Sagemaker",
        "GitLab CICD",
        "Snowflake",
        "Terraform"
      ]
    },
      {
      "title": "Principal Full Stack Developer",
      "role": "",
      "company": "BHP",
      "from": "01/2024",
      "to": "07/2025",
      "location": "Western Australia",
      "description": "",
      "achievements": [
        "Productionised a proof of concept Machine Learning system aimed at increasing ore throughput by optimising rail grinding activities.",
        "Improved workflows and software reliability by implementing CI/CD pipelines to ensure that changes had proper unit, contract and integration testing.",
        "Guided team on cybersecurity issues, improvements and remediations for bespoke and COTS applications."
      ],
      "technologies": [
        "Python",
        "AWS",
        "GitLab CICD",
        "Snowflake",
        "SQL",
        "Terraform"
      ]
    },
    {
      "title": "Principal Cybernetics Engineer",
      "role": "",
      "company": "BHP",
      "from": "10/2021",
      "to": "01/2024",
      "location": "Western Australia",
      "description": "",
      "achievements": [
        "Worked to consolidate multiple vendor provided safety systems across heavy and light vehicle fleets into a single view of driver behaviour.",
        "Business process improvement on issues that were preventing safety systems and processes from working as intended.",
        "Developed solutions to improve reliability of safety systems through monitoring silent modes of failure.",
        "Implement better DevSecOps tooling and process into our software development process.",
        "Performed a technical architecture review on large distributed brownfields project which resulted in refactoring for cloud migration.",
        "Migrated an on premises HBase cluster running large time series warehousing workloads to AWS Elastic Map Reduce (EMR) with reduced total compute.",
        "Took up a product management role to cover a secondment within the team.",
        "Improved monitoring and alerting to ensure that we could more easily track and diagnose system degradations."
      ],
      "technologies": [
        "Python",
        "HBase",
        "Hadoop",
        "Kafka",
        "AWS",
        "Terraform",
        "GitLab CICD",
        "SQL"
      ]
    },
    {
      "title": "Specialist Engineer/Technical Lead",
      "role": "",
      "company": "BHP",
      "from": "06/2020",
      "to": "10/2021",
      "location": "Western Australia",
      "description": "",
      "achievements": [
        "Contributed to multiple projects including conveyor throughput optimisation, safety dashboard development and WTS/LTE network monitoring for autonomous and conventional haulage vehicles.",
        "Performed root cause analysis on incidents to focus efforts to improve application reliability.",
        "Built reliable stream and batch data collection and processing pipelines using NiFi, Kafka and Python.",
        "Managed work for four people in an agile team, under the scrum of scrums structure.",
        "Improved reliability of distributed edge deployments by migrating from RHEL packages to containerised deployment stacks."
      ],
      "technologies": [
        "Hadoop",
        "HBase",
        "Python",
        "NiFi",
        "Kafka",
        "SQL",
        "Docker",
        "Git",
        "Jira"
      ]
    },
    {
      "title": "Specialist Cybernetics Engineer",
      "role": "",
      "company": "BHP",
      "from": "11/2018",
      "to": "06/2020",
      "location": "Western Australia",
      "description": "",
      "achievements": [
        "Primarily involved in developing and rolling out a large bespoke operational technology platform which collected and stored over 20,000 numeric metrics a second from multiple mines in Western Australia Iron Ore.",
        "Extended monitoring system to cover South American Copper and East Australian Coal sites.",
        "Developed data collection code for multiple in field assets including radios, safety system, access points, microwave links, solar controllers and LTE equipment through a variety of methods and protocols.",
        "Implemented improvements in reliability and monitoring to code and underlying linux production environments that hosted the code."
      ],
      "technologies": [
        "Python",
        "Linux",
        "TeamCity",
        "Git",
        "Jira"
      ]
    },
    {
      "title": "Undergraduate/Graduate Mechanical Engineer",
      "role": "",
      "company": "WorleyParsons",
      "from": "01/2018",
      "to": "10/2018",
      "location": "Western Australia",
      "description": "",
      "achievements": [
        "Standardised thousands of legacy vessel and pipeline inspections with data sources including paper based inspections, Microsoft Access databases and Excel spreadsheets.",
        "Assisted in a reconciliation process involving identifying the differences between as‑built isometrics and general arrangements with items presently on site.",
        "Wrote numerous VBA scripts and addons to improve productivity of myself and others."
      ],
      "technologies": [
        "VBA",
        "Excel"
      ]
    },
    {
      "title": "Undergraduate Engineer",
      "role": "",
      "company": "Primero Group PTY LTD",
      "from": "10/2015",
      "to": "03/2016",
      "location": "Western Australia",
      "description": "",
      "achievements": [
        "Worked across the Project Management and Mechanical Engineering Departments.",
        "Developed software in VBA to automate the creation of standardised engineering calculations.",
        "Automated the creation of Project Management documents and processes using the VBA object models for Excel, Outlook and Word.",
        "Used Primavera P6 to update the schedule of ongoing projects."
      ],
      "technologies": [
        "Primavera P6",
        "VBA",
        "Excel"
      ]
    }
  ]
}